---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCTransformSetter.Dispose
source: html/bc23a52d-88bb-87f6-4a48-1c16660f8da4.htm
---
# Autodesk.Revit.DB.IFC.IFCTransformSetter.Dispose Method

Releases all resources used by the IFCTransformSetter

## Syntax (C#)
```csharp
public void Dispose()
```